■アセンブルリスト　
 ADDR: メモリ内容　　　　　プログラム　
     :                     CASL      START     
 8000: 7001 0000 7002 0000           RPUSH     
     : 7003 0000 7004 0000
     : 7005 0000 7006 0000
     :（合計14語の領域。省略）
     :                     ;        ST     GR1, A
     :                     ;        ST     GR2, B
 800E: 1230 0004                     LAD       GR3,4
 8010: 3010 801B                     AND       GR1,=#000F
     :                      ;       ST     GR1, RESULT
     :                       ;      LD     GR1, A
 8012: 5313 0000                     SRL       GR1,0,GR3
 8014: 3010 801B                     AND       GR1,=#000F
 8016: 3020 801B                     AND       GR2,=#000F
 8018: 2612                          ADDL      GR1,GR2
 8019: 4110 801C                     CPL       GR1,=10
     :                      ;***　リテラルのDC行自動生成　***
 801B: 000F                =#000F    DC        #000F
 801C: 000A                =10       DC        10
     :                               END       

